; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v7 - type_1 ?v6 - type_2)
 	      (pred_2 ?v2 - object ?v6 - type_2)
	      (pred_1 ?v7 - type_1 ?v8 - type_3)
	      (pred_4 ?v7 - type_1 ?v2 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v7 - type_1 ?v1 ?v3 - type_2)
       :precondition (and  (pred_3 ?v7 ?v1))
       :effect (and  (pred_3 ?v7 ?v3)
		     (not (pred_3 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_1 ?v4 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v5) (pred_3 ?v7 ?v5) (pred_1 ?v7 ?v8))
       :effect (and (pred_4 ?v7 ?v4 ?v8)
		    (not (pred_2 ?v4 ?v5)) 
		    (not (pred_1 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_1 ?v4 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v4 ?v8) (pred_3 ?v7 ?v5))
       :effect (and (pred_2 ?v4 ?v5)
		    (pred_1 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v4 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_04 obj_09 - type_1
obj_01 obj_08 obj_10 obj_03 - type_3
obj_07 obj_02 obj_12 - type_2
obj_06 obj_11 obj_05 - object)
(:init
(pred_3 obj_04 obj_02)
(pred_1 obj_04 obj_01)
(pred_1 obj_04 obj_08)
(pred_3 obj_09 obj_07)
(pred_1 obj_09 obj_10)
(pred_1 obj_09 obj_03)
(pred_2 obj_06 obj_02)
(pred_2 obj_11 obj_02)
(pred_2 obj_05 obj_02)
)
(:goal
(and
(pred_2 obj_06 obj_12)
(pred_2 obj_11 obj_12)
(pred_2 obj_05 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_04 obj_12)))
)
)

; plan
1. (op_2 obj_04 obj_06 obj_02 obj_08)
   deleted: (pred_2 obj_06 obj_02) (pred_1 obj_04 obj_08)
   added: (pred_4 obj_04 obj_06 obj_08)
   goals met: 0 of 3
2. (op_1 obj_09 obj_07 obj_02)
   deleted: (pred_3 obj_09 obj_07)
   added: (pred_3 obj_09 obj_02)
   goals met: 0 of 3
3. (op_2 obj_04 obj_05 obj_02 obj_01)
   deleted: (pred_2 obj_05 obj_02) (pred_1 obj_04 obj_01)
   added: (pred_4 obj_04 obj_05 obj_01)
   goals met: 0 of 3
4. (op_2 obj_09 obj_11 obj_02 obj_03)
   deleted: (pred_2 obj_11 obj_02) (pred_1 obj_09 obj_03)
   added: (pred_4 obj_09 obj_11 obj_03)
   goals met: 0 of 3
5. (op_1 obj_09 obj_02 obj_12)
   deleted: (pred_3 obj_09 obj_02)
   added: (pred_3 obj_09 obj_12)
   goals met: 0 of 3
6. (op_3 obj_09 obj_11 obj_12 obj_03)
   deleted: (pred_4 obj_09 obj_11 obj_03)
   added: (pred_2 obj_11 obj_12) (pred_1 obj_09 obj_03)
   goals met: 1 of 3
7. (op_1 obj_09 obj_12 obj_02)
   deleted: (pred_3 obj_09 obj_12)
   added: (pred_3 obj_09 obj_02)
   goals met: 1 of 3
8. (op_3 obj_04 obj_06 obj_02 obj_08)
   deleted: (pred_4 obj_04 obj_06 obj_08)
   added: (pred_2 obj_06 obj_02) (pred_1 obj_04 obj_08)
   goals met: 1 of 3
9. (op_2 obj_09 obj_06 obj_02 obj_03)
   deleted: (pred_2 obj_06 obj_02) (pred_1 obj_09 obj_03)
   added: (pred_4 obj_09 obj_06 obj_03)
   goals met: 1 of 3
10. (op_1 obj_09 obj_02 obj_12)
   deleted: (pred_3 obj_09 obj_02)
   added: (pred_3 obj_09 obj_12)
   goals met: 1 of 3
11. (op_3 obj_09 obj_06 obj_12 obj_03)
   deleted: (pred_4 obj_09 obj_06 obj_03)
   added: (pred_2 obj_06 obj_12) (pred_1 obj_09 obj_03)
   goals met: 2 of 3
12. (op_1 obj_09 obj_12 obj_02)
   deleted: (pred_3 obj_09 obj_12)
   added: (pred_3 obj_09 obj_02)
   goals met: 2 of 3
13. (op_3 obj_04 obj_05 obj_02 obj_01)
   deleted: (pred_4 obj_04 obj_05 obj_01)
   added: (pred_2 obj_05 obj_02) (pred_1 obj_04 obj_01)
   goals met: 2 of 3
14. (op_2 obj_09 obj_05 obj_02 obj_03)
   deleted: (pred_2 obj_05 obj_02) (pred_1 obj_09 obj_03)
   added: (pred_4 obj_09 obj_05 obj_03)
   goals met: 2 of 3
15. (op_1 obj_09 obj_02 obj_12)
   deleted: (pred_3 obj_09 obj_02)
   added: (pred_3 obj_09 obj_12)
   goals met: 2 of 3
16. (op_3 obj_09 obj_05 obj_12 obj_03)
   deleted: (pred_4 obj_09 obj_05 obj_03)
   added: (pred_2 obj_05 obj_12) (pred_1 obj_09 obj_03)
   goals met: 3 of 3
